## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/9278149251)



<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.image_builder_ado_pat_gcp_secret_name
  * github_actions_variable.image_builder_gh_workflow_gcp_service_account_email
  * google_secret_manager_secret_iam_member.image_builder_ado_pat
  * google_service_account.image-builder-gh-workflow
  * google_service_account_iam_binding.image_builder_gh_workflow_workload_identity
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.image_builder_ado_pat_gcp_secret_name will be created
  + resource "github_actions_variable" "image_builder_ado_pat_gcp_secret_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "image-builder-ado-pat"
      + variable_name = "IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME"
    }

  # github_actions_variable.image_builder_gh_workflow_gcp_service_account_email will be created
  + resource "github_actions_variable" "image_builder_gh_workflow_gcp_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "IMAGE_BUILDER_GH_WORKFLOW_GCP_SERVICE_ACCOUNT_EMAIL"
    }

  # google_secret_manager_secret_iam_member.image_builder_ado_pat will be created
  + resource "google_secret_manager_secret_iam_member" "image_builder_ado_pat" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "image-builder-ado-pat"
    }

  # google_service_account.image-builder-gh-workflow will be created
  + resource "google_service_account" "image-builder-gh-workflow" {
      + account_id   = "image-builder-gh-workflow"
      + description  = "Service account used by image-builder reusable workflow to access GCP secret manager. Reusable workflow is defined in the test-infra repository."
      + disabled     = false
      + display_name = "image-builder-gh-workflow"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.image_builder_gh_workflow_workload_identity will be created
  + resource "google_service_account_iam_binding" "image_builder_gh_workflow_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflowimage-builder.yml",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":10860,"Program":"tfcmt","SHA1":"477b7bfa07a42ccde9aa94493bf54d20d2b38f59","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->